Conf.Simple/src/InformationRegisters/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена</name>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_full</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_base64</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>hash_owner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode_owner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_property</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>series_number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>hash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ШтрихкодыУпаковокДокументовОбмена/SUI_ШтрихкодыУпаковокДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ШтрихкодыУпаковокДокументовОбмена</name>
  <resources>
    <name>id_barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>hash</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_series/SUI_docs_tbl_series.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_series</name>
  <resources>
    <name>id_good</name>
    <comment>Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <comment>Характеристика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <comment>Серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <comment>Склад</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>best_before</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>production_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиСтрок/SUI_СтатусыОбработкиСтрок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиСтрок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеТребуется</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыОтсканированныеШтрихкодыУпаковок() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.hash КАК hash,
		|	ЗагружаемаяТаблица.barcode КАК barcode,
		|	ЗагружаемаяТаблица.barcode_full,
		|	ЗагружаемаяТаблица.barcode_base64,
		|	ЗагружаемаяТаблица.hash_owner,
		|	ЗагружаемаяТаблица.barcode_owner,
		|	ЗагружаемаяТаблица.id_good,
		|	ЗагружаемаяТаблица.id_property,
		|	ЗагружаемаяТаблица.id_unit,
		|	ЗагружаемаяТаблица.id_series,
		|	ЗагружаемаяТаблица.series_number
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	barcode
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтсканированныеШтрихкодыУпаковок.hash КАК hash,
		|	ОтсканированныеШтрихкодыУпаковок.ДатаЗаписи
		|ПОМЕСТИТЬ втОтсканированныеШтрихкодыУпаковок
		|ИЗ
		|	РегистрСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена КАК ОтсканированныеШтрихкодыУпаковок
		|ГДЕ
		|	ОтсканированныеШтрихкодыУпаковок.sid_doc = &ИдентификаторДокументаОбмена
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	hash
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	втЗагружаемаяТаблица.hash,
		|	втЗагружаемаяТаблица.barcode,
		|	втЗагружаемаяТаблица.barcode_full,
		|	втЗагружаемаяТаблица.barcode_base64,
		|	втЗагружаемаяТаблица.hash_owner,
		|	втЗагружаемаяТаблица.barcode_owner,
		|	втЗагружаемаяТаблица.id_good,
		|	втЗагружаемаяТаблица.id_property,
		|	втЗагружаемаяТаблица.id_unit,
		|	втЗагружаемаяТаблица.id_series,
		|	втЗагружаемаяТаблица.series_number,
		|	ЕСТЬNULL(втОтсканированныеШтрихкодыУпаковок.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОтсканированныеШтрихкодыУпаковок КАК втОтсканированныеШтрихкодыУпаковок
		|		ПО втЗагружаемаяТаблица.hash = втОтсканированныеШтрихкодыУпаковок.hash";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("hash", "hash");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ЗначениеЗаполнено(Запись.ДатаЗаписи) Тогда
				Запись.ДатаОбновления = ТекущаяДатаСеанса();
			Иначе
				Запись.ДатаЗаписи = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = НСтр("ru = 'Не удалось загрузить отсканированные штрихкоды упаковок документа обмена (%1)!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура ВыполнитьОбработкуОтсканированныхШтрихкодов(Параметры) Экспорт
	
	ИмяКонтекстаВызова = "РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.ВыполнитьОбработкуОтсканированныхШтрихкодов";
	
	ОжидаемыеТипыСвойств = Новый Структура();
	ОжидаемыеТипыСвойств.Вставить("ИдентификаторДокументаОбмена", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяКонтекстаВызова, "Параметры", Параметры, Тип("Структура"),
		ОжидаемыеТипыСвойств);
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ПолучитьДанныеДляОбработкиОтсканированныхШтрихкодов(Параметры.ИдентификаторДокументаОбмена);
	
	Построитель = Новый ПостроительЗапроса();
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(РезультатЗапроса);
	
	ОтборОбработано = Построитель.Отбор.Добавить("Обработано");
	ОтборОбработано.ВидСравнения = ВидСравнения.Равно;
	ОтборОбработано.Значение = Ложь;
	ОтборОбработано.Использование = Истина;
	
	Построитель.Выполнить();
	
	Если Построитель.Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("hash", "hash");
		Блокировка.Заблокировать();
		
		// Сформировать дерево отсканированных штрихкодов
		Дерево = СформироватьДеревоОтсканированныхШтрихкодовПоРезультатуЗапроса(РезультатЗапроса);
		Дерево.Колонки.Добавить("id_barcode");
		
		// Сформировать таблицу штрихкодов упаковок документов обмена
		ТаблицаШтрихкодыУпаковок = РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.ПолучитьТаблицуЭталон();
		
		// Выполнить обработку строк дерева отсканированных штрихкодов
		ОбработатьСтрокиДереваОтсканированныхШтрихкодов(Дерево.Строки, ПолучитьАлгоритмСозданияШтрихкода(), 
			Новый Массив(), ТаблицаШтрихкодыУпаковок);
		
		// Записать обработанные штрихкоды упаковок в регистр сведений Штрихкоды упаковок документов обмена
		РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.ЗагрузитьОтсканированныеШтрихкоды(
			Параметры.ИдентификаторДокументаОбмена, ТаблицаШтрихкодыУпаковок);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , , , Ошибка);
		ТекстОшибки = НСтр("ru = 'Не удалось обработать отсканированные штрихкоды упаковок документа обмена (%1)!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Параметры.ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьОтсканированныеШтрихкоды(Отбор = Неопределено, Первые = 0) Экспорт
	
	Запрос = СформироватьЗапросОтсканированныеШтрихкоды(Отбор, Первые);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДеревоОтсканированныхШтрихкодовЭталон() Экспорт
	
	ДеревоОтсканированныхШтрихкодов = Новый ДеревоЗначений();
	
	КолонкиБезТипа = Новый Массив();
	КолонкиБезТипа.Добавить("id_good");
	КолонкиБезТипа.Добавить("id_property");
	КолонкиБезТипа.Добавить("id_unit");
	КолонкиБезТипа.Добавить("id_series");
	
	Для Каждого КолонкаДляДерева Из ПолучитьТаблицуЭталон().Колонки Цикл
		ДеревоОтсканированныхШтрихкодов.Колонки.Добавить(КолонкаДляДерева.Имя,
			?(КолонкиБезТипа.Найти(КолонкаДляДерева.Имя) = Неопределено, КолонкаДляДерева.ТипЗначения, Неопределено));
	КонецЦикла;
	
	Возврат ДеревоОтсканированныхШтрихкодов;
	
КонецФункции

Функция ПолучитьДеревоОтсканированныхШтрихкодовПоДокументу(ИдентификаторДокументаОбмена) Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("sid_doc", ИдентификаторДокументаОбмена);
	
	РезультатЗапроса = ПолучитьОтсканированныеШтрихкоды(Отбор);
	
	Дерево = СформироватьДеревоОтсканированныхШтрихкодовПоРезультатуЗапроса(РезультатЗапроса);
	
	Возврат Дерево;
	
КонецФункции

Процедура СброситьПризнакОбработки(Параметры, АдресРезультата) Экспорт
	
	ИмяКонтекстаВызова = "РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.СброситьПризнакОбработки";
	
	ОжидаемыеТипыСвойств = Новый Структура();
	ОжидаемыеТипыСвойств.Вставить("sid_doc", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяКонтекстаВызова, "Параметры", Параметры, Тип("Структура"),
		ОжидаемыеТипыСвойств);
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("sid_doc", Параметры.sid_doc);
		
		Если Параметры.Свойство("hash") Тогда
			ЭлементБлокировки.УстановитьЗначение("hash", Параметры.hash);
		КонецЕсли;
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.sid_doc.Установить(Параметры.sid_doc);
		
		Если Параметры.Свойство("hash") Тогда
			НаборЗаписей.Отбор.hash.Установить(Параметры.hash);
		КонецЕсли;
		
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Обработано = Ложь;
			Запись.ДатаОбновления = ТекущаяДатаСеанса();
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , , , Ошибка);
		ТекстОшибки = НСтр("ru = 'Не удалось сбросить признак обработки отсканированных штрихкодов!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Параметры.ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьМассивОтсканированныхШтрихкодовДляПрямойЗагрузки(ИдентификаторДокументаОбмена) Экспорт
	
	МассивОтсканированныхШтрихкодов = Новый Массив();
	
	Дерево = ПолучитьДеревоОтсканированныхШтрихкодовПоДокументу(ИдентификаторДокументаОбмена);
	
	ЗаполнитьМассивОтсканированныхШтрихкодовДляПрямойЗагрузки(Дерево.Строки, МассивОтсканированныхШтрихкодов);
	
	Возврат МассивОтсканированныхШтрихкодов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросОтсканированныеШтрихкоды(Отбор = Неопределено, Первые = 0, ПоместитьВ = "", МенеджерВТ = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтсканированныеШтрихкоды.sid_doc,
		|	ОтсканированныеШтрихкоды.hash,
		|	ОтсканированныеШтрихкоды.barcode,
		|	ОтсканированныеШтрихкоды.barcode_full,
		|	ОтсканированныеШтрихкоды.barcode_base64,
		|	ОтсканированныеШтрихкоды.hash_owner,
		|	ОтсканированныеШтрихкоды.barcode_owner,
		|	ОтсканированныеШтрихкоды.id_good,
		|	ОтсканированныеШтрихкоды.id_property,
		|	ОтсканированныеШтрихкоды.id_unit,
		|	ОтсканированныеШтрихкоды.id_series,
		|	ОтсканированныеШтрихкоды.series_number,
		|	ОтсканированныеШтрихкоды.ДатаЗаписи,
		|	ОтсканированныеШтрихкоды.ДатаОбновления,
		|	ОтсканированныеШтрихкоды.Обработано
		|ИЗ
		|	РегистрСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена КАК ОтсканированныеШтрихкоды";
	
	ПерезагрузитьТекстЗапроса = Ложь;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорыПакета = ЗапросПакета.Операторы[0];
	
	Если Первые > 0 Тогда
		
		ОператорыПакета.КоличествоПолучаемыхЗаписей = Первые;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		
		ИмяФункцииВызова = "РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.СформироватьЗапросОтсканированныеШтрихкоды";
		
		ПроверяемыеТипыОтбора = Новый Массив();
		ПроверяемыеТипыОтбора.Добавить(Тип("Структура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("Соответствие"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, "Отбор", Отбор, 
			Новый ОписаниеТипов(ПроверяемыеТипыОтбора));
		
		Для Каждого КлючЗначение Из Отбор Цикл
		
			ТипЗначения = ТипЗнч(КлючЗначение.Значение);
			КлючПараметра = СтрЗаменить(КлючЗначение.Ключ, ".", "_");
			
			Если ТипЗначения = Тип("Массив") Или 
				ТипЗначения = Тип("ФиксированныйМассив") Или
				ТипЗначения = Тип("СписокЗначений") Тогда
				
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 В (&%2)", КлючЗначение.Ключ, КлючПараметра));
				
			Иначе
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 = &%2", КлючЗначение.Ключ, КлючПараметра));
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючПараметра, КлючЗначение.Значение);
			
			ПерезагрузитьТекстЗапроса = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПоместитьВ) Тогда
		
		Если МенеджерВТ = Неопределено Тогда
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Иначе
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		КонецЕсли;
		
		ЗапросПакета.ТаблицаДляПомещения = ПоместитьВ;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если ПерезагрузитьТекстЗапроса Тогда
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция СформироватьДеревоОтсканированныхШтрихкодовПоРезультатуЗапроса(РезультатЗапросаОтсканированныеШтрихкоды)
	
	Дерево = ДеревоОтсканированныхШтрихкодовЭталон();
	
	СоответствияШтрихкодов = Новый Соответствие();
	
	Выборка = РезультатЗапросаОтсканированныеШтрихкоды.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    
	    ЗаполнитьЗначенияСвойств(Дерево.Строки.Добавить(), Выборка);
	    
	    Если Не ПустаяСтрока(Выборка.hash_owner) Тогда
	    	СоответствияШтрихкодов.Вставить(Выборка.hash, Выборка.hash_owner);
	    КонецЕсли;
	    
	КонецЦикла;
	
	Для Каждого КлючЗначение Из СоответствияШтрихкодов Цикл
		
		НайденнаяСтрока = Дерево.Строки.Найти(КлючЗначение.Ключ, "hash", Истина);
		НайденнаяСтрокаРодитель = Дерево.Строки.Найти(КлючЗначение.Значение, "hash", Истина);
		
		Если НайденнаяСтрока <> Неопределено И НайденнаяСтрокаРодитель <> Неопределено И
			НайденнаяСтрока <> НайденнаяСтрокаРодитель Тогда
			ПереместитьСтрокуДерева(Дерево, НайденнаяСтрока, НайденнаяСтрокаРодитель);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции

Процедура ПереместитьСтрокуДерева(Дерево, ПеремещаемаяСтрока, НовыйРодитель, Уровень = 0)
	
	Если Уровень = 0 Тогда
		
		НоваяСтрока = НовыйРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПеремещаемаяСтрока);
		ПереместитьСтрокуДерева(Дерево, ПеремещаемаяСтрока, НоваяСтрока, Уровень + 1);
		
		Если ПеремещаемаяСтрока.Родитель = Неопределено Тогда
			Дерево.Строки.Удалить(ПеремещаемаяСтрока);
		Иначе
			ПеремещаемаяСтрока.Родитель.Строки.Удалить(ПеремещаемаяСтрока);
		КонецЕсли;
		
	Иначе
		
		Для Каждого Стр Из ПеремещаемаяСтрока.Строки Цикл
			
			НоваяСтрока = НовыйРодитель.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПеремещаемаяСтрока);
			ПереместитьСтрокуДерева(Дерево, Стр, НоваяСтрока, Уровень + 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеДляОбработкиОтсканированныхШтрихкодов(ИдентификаторДокументаОбмена) Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("sid_doc", ИдентификаторДокументаОбмена);
	
	Запрос = СформироватьЗапросОтсканированныеШтрихкоды(Отбор, , "втОтсканированныеШтрихкоды");
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", 
		SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	
	Запрос.Текст = Запрос.Текст + SUI_ОбщегоНазначения.РазделительПакетаЗапросов() + "ВЫБРАТЬ
	|	втОтсканированныеШтрихкоды.hash КАК hash,
	|	втОтсканированныеШтрихкоды.id_good КАК id_good,
	|	втОтсканированныеШтрихкоды.id_property КАК id_property,
	|	втОтсканированныеШтрихкоды.series_number КАК series_number
	|ПОМЕСТИТЬ втОтсканированныеШтрихкодыБезСерии
	|ИЗ
	|	втОтсканированныеШтрихкоды КАК втОтсканированныеШтрихкоды
	|ГДЕ
	|	НЕ втОтсканированныеШтрихкоды.id_series ПОДОБНО &ШаблонИдентификатораSimple
	|	И втОтсканированныеШтрихкоды.series_number <> """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	id_good,
	|	id_property,
	|	series_number
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СерииДокументовОбмена.id_good КАК id_good,
	|	СерииДокументовОбмена.id_properties КАК id_property,
	|	СерииДокументовОбмена.number КАК series_number,
	|	СерииДокументовОбмена.id_series
	|ПОМЕСТИТЬ втСерииДокументаОбмена
	|ИЗ
	|	РегистрСведений.SUI_docs_tbl_series КАК СерииДокументовОбмена
	|ГДЕ
	|	СерииДокументовОбмена.sid_doc = &sid_doc
	|	И СерииДокументовОбмена.СтатусОбработки <> ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
	|	И СерииДокументовОбмена.number <> """"
	|	И СерииДокументовОбмена.id_series ПОДОБНО &ШаблонИдентификатораSimple
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	id_good,
	|	id_property,
	|	series_number
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОтсканированныеШтрихкодыБезСерии.hash КАК hash,
	|	ЕСТЬNULL(втСерииДокументаОбмена.id_series, """") КАК id_series
	|ПОМЕСТИТЬ втОтсканированныеШтрихкодыСНовойСерией
	|ИЗ
	|	втОтсканированныеШтрихкодыБезСерии КАК втОтсканированныеШтрихкодыБезСерии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСерииДокументаОбмена КАК втСерииДокументаОбмена
	|		ПО втОтсканированныеШтрихкодыБезСерии.id_good = втСерииДокументаОбмена.id_good
	|		И втОтсканированныеШтрихкодыБезСерии.id_property = втСерииДокументаОбмена.id_property
	|		И втОтсканированныеШтрихкодыБезСерии.series_number = втСерииДокументаОбмена.series_number
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втОтсканированныеШтрихкодыБезСерии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втСерииДокументаОбмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтсканированныеШтрихкоды.sid_doc,
	|	ОтсканированныеШтрихкоды.hash,
	|	ОтсканированныеШтрихкоды.barcode,
	|	ОтсканированныеШтрихкоды.barcode_full,
	|	ОтсканированныеШтрихкоды.barcode_base64,
	|	ОтсканированныеШтрихкоды.hash_owner,
	|	ОтсканированныеШтрихкоды.barcode_owner,
	|	ОтсканированныеШтрихкоды.id_good,
	|	ОтсканированныеШтрихкоды.id_property,
	|	ОтсканированныеШтрихкоды.id_unit,
	|	ЕСТЬNULL(втОтсканированныеШтрихкодыСНовойСерией.id_series, ОтсканированныеШтрихкоды.id_series) КАК id_series,
	|	ОтсканированныеШтрихкоды.series_number,
	|	ОтсканированныеШтрихкоды.ДатаЗаписи,
	|	ОтсканированныеШтрихкоды.ДатаОбновления,
	|	ВЫБОР
	|		КОГДА НЕ ОтсканированныеШтрихкоды.Обработано
	|		ИЛИ НЕ втОтсканированныеШтрихкодыСНовойСерией.id_series ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Обработано
	|ИЗ
	|	втОтсканированныеШтрихкоды КАК ОтсканированныеШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОтсканированныеШтрихкодыСНовойСерией КАК втОтсканированныеШтрихкодыСНовойСерией
	|		ПО ОтсканированныеШтрихкоды.hash = втОтсканированныеШтрихкодыСНовойСерией.hash";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ОбработатьСтрокиДереваОтсканированныхШтрихкодов(СтрокиДерева, АлгоритмСозданияШтрихкода, ВложенныеШтрихкоды, 
	ТаблицаШтрихкодыУпаковок)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		ВложенныеШтрихкодыПоСтроке = Новый Массив();
		
		ОбработатьСтрокиДереваОтсканированныхШтрихкодов(СтрокаДерева.Строки, АлгоритмСозданияШтрихкода, 
			ВложенныеШтрихкодыПоСтроке, ТаблицаШтрихкодыУпаковок);
		
		Если Не СтрокаДерева.Обработано Тогда
			
			ОбработатьСтрокуДереваАлгоритмомСозданияШтрихкодаУпаковки(СтрокаДерева, АлгоритмСозданияШтрихкода, 
				ВложенныеШтрихкодыПоСтроке);
			
			СтрокаДерева.Обработано = Истина;
			
			ОбновитьЗаписьПоСтрокеДерева(СтрокаДерева);
			
			НоваяСтрокаШК = ТаблицаШтрихкодыУпаковок.Добавить();
			НоваяСтрокаШК.hash = СтрокаДерева.hash;
			НоваяСтрокаШК.barcode = СтрокаДерева.barcode;
			НоваяСтрокаШК.id_barcode = СтрокаДерева.id_barcode;
			
		КонецЕсли;
		
		ВложенныеШтрихкоды.Добавить(СтрокаДерева.barcode);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьСтрокуДереваАлгоритмомСозданияШтрихкодаУпаковки(СтрокаДерева, Алгоритм, ВложенныеШтрихкоды)
	
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(СтрокаДерева.barcode);
	ПараметрыМетода.Добавить(СтрокаДерева.barcode_owner);
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтрокаДерева.id_good) Тогда
		ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаДерева.id_good, Истина));
	ИначеЕсли ПустаяСтрока(СтрокаДерева.id_good) Тогда
		ПараметрыМетода.Добавить(Неопределено);
	Иначе
		ПараметрыМетода.Добавить(СтрокаДерева.id_good);
	КонецЕсли;
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтрокаДерева.id_property) Тогда
		ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаДерева.id_property, Истина));
	ИначеЕсли ПустаяСтрока(СтрокаДерева.id_property) Тогда
		ПараметрыМетода.Добавить(Неопределено);
	Иначе
		ПараметрыМетода.Добавить(СтрокаДерева.id_property);
	КонецЕсли;
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтрокаДерева.id_series) Тогда
		ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаДерева.id_series, Истина));
	ИначеЕсли ПустаяСтрока(СтрокаДерева.id_series) Тогда
		ПараметрыМетода.Добавить(Неопределено);
	Иначе
		ПараметрыМетода.Добавить(СтрокаДерева.id_series);
	КонецЕсли;
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтрокаДерева.id_unit) Тогда
		ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаДерева.id_unit, Истина));
	ИначеЕсли ПустаяСтрока(СтрокаДерева.id_unit) Тогда
		ПараметрыМетода.Добавить(Неопределено);
	Иначе
		ПараметрыМетода.Добавить(СтрокаДерева.id_unit);
	КонецЕсли;
	
	//TODO: artem - 14.05.2025 - Врем. откл. передачи ячейки
//	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтрокаДерева.id_cell) Тогда
//		ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаДерева.id_cell, Истина));
//	ИначеЕсли ПустаяСтрока(СтрокаДерева.id_cell) Тогда
//		ПараметрыМетода.Добавить(Неопределено);
//	Иначе
//		ПараметрыМетода.Добавить(СтрокаДерева.id_cell);
//	КонецЕсли;
	ПараметрыМетода.Добавить(Неопределено); // Ячейка
	
	ПараметрыМетода.Добавить(Неопределено); // Штрихкод упаковки
	ПараметрыМетода.Добавить(ВложенныеШтрихкоды); // Массив вложенных штрихкодов
	
	Попытка
		ПараметрыМетода = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"SUI_ШтрихкодыУпаковок.СоздатьШтрихкодУпаковки", Алгоритм, ПараметрыМетода, Истина);
	Исключение
		ТекстОшибки = НСтр("ru = 'Ошибка выполнения алгоритма создания штрихкодов упаковок по штрихкоду %1!
		|Идентификатор документа обмена: %2'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДерева.barcode, СтрокаДерева.sid_doc);
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	ШтрихкодУпаковки = ПараметрыМетода[ПараметрыМетода.ВГраница() - 1];
	
	Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
		
		ИдентификаторШтрихкодаУпаковки = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ШтрихкодУпаковки, Истина);
		
		Если ПустаяСтрока(ИдентификаторШтрихкодаУпаковки) Тогда
			СтрокаДерева.id_barcode = ШтрихкодУпаковки;
		Иначе
			СтрокаДерева.id_barcode = ИдентификаторШтрихкодаУпаковки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьЗаписьПоСтрокеДерева(СтрокаДерева)
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.sid_doc = СтрокаДерева.sid_doc;
	Запись.hash = СтрокаДерева.hash;
	
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		
		СтрокаДерева.ДатаОбновления = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДерева, , "sid_doc, hash");
		Запись.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьАлгоритмСозданияШтрихкода()
	
	НастройкаШтрихкодыУпаковок = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодыУпаковок, 
		"АлгоритмСозданияШтрихкодаУпаковки.Алгоритм", "", Тип("Строка"));
	
КонецФункции

Функция ПолучитьАлгоритмНормализацииШтрихкода() Экспорт
	
	НастройкаШтрихкодыУпаковок = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодыУпаковок, 
		"АлгоритмНормализацииЗначенияШтрихкода.Алгоритм", "", Тип("Строка"));
	
КонецФункции

Процедура ЗаполнитьМассивОтсканированныхШтрихкодовДляПрямойЗагрузки(СтрокиДерева, МассивШтрихкодов)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		СтрокаДереваРодитель = СтрокаДерева.Родитель;
		
		ДанныеШтрихкода = Новый Структура();
		ДанныеШтрихкода.Вставить("ШтрихкодМаркиАлкогольнойПродукции", "");
		ДанныеШтрихкода.Вставить("Количество", 1);
		ДанныеШтрихкода.Вставить("ФорматBase64", Не ПустаяСтрока(СтрокаДерева.barcode_base64));
		ДанныеШтрихкода.Вставить("Штрихкод", "");
		ДанныеШтрихкода.Вставить("ШтрихкодУпаковки", "");
		
		Если ДанныеШтрихкода.ФорматBase64 И СтрокаДереваРодитель <> Неопределено Тогда
			ДанныеШтрихкода.ФорматBase64 = Не ПустаяСтрока(СтрокаДереваРодитель.barcode_base64);
		КонецЕсли;
		
		Если ДанныеШтрихкода.ФорматBase64 Тогда
			ДанныеШтрихкода.Штрихкод = СтрокаДерева.barcode_base64;
		ИначеЕсли Не ПустаяСтрока(СтрокаДерева.barcode_full) Тогда
			ДанныеШтрихкода.Штрихкод = СтрокаДерева.barcode_full;
		Иначе
			ДанныеШтрихкода.Штрихкод = СтрокаДерева.barcode;
		КонецЕсли;
		
		Если СтрокаДереваРодитель <> Неопределено Тогда
			
			Если ДанныеШтрихкода.ФорматBase64 Тогда
				ДанныеШтрихкода.ШтрихкодУпаковки = СтрокаДереваРодитель.barcode_base64;
			ИначеЕсли Не ПустаяСтрока(СтрокаДереваРодитель.barcode_full) Тогда
				ДанныеШтрихкода.ШтрихкодУпаковки = СтрокаДереваРодитель.barcode_full;
			Иначе
				ДанныеШтрихкода.ШтрихкодУпаковки = СтрокаДереваРодитель.barcode;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеШтрихкода.Штрихкод) Тогда
			МассивШтрихкодов.Добавить(ДанныеШтрихкода);
		КонецЕсли;
		
		ЗаполнитьМассивОтсканированныхШтрихкодовДляПрямойЗагрузки(СтрокаДерева.Строки, МассивШтрихкодов);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
